/**************************************
  > File Name: 四线双极性步进电机
  > Author: pengshp
  > Mail: pengshp3@outlook.com
  > Date: 2015年 7 月 26 日
***************************************/
#include <reg51.h>
#define uchar unsigned char
#define uint unsigned int

sbit PH1=P1^0;//A线圈电流控制
sbit PH2=P1^1;//B线圈电流控制
sbit T01=P1^2;//UDN2916电流控制
sbit T11=P1^4;
sbit T02=P1^3;
sbit T12=P1^5;

void Delay(uchar t)//延时函数
{
	uchar a;
	while(t--)
	{
		for(a=70;a>0;a--);
	}
}

/*半步八拍节拍控制函数*/
void Step()
{
	/*A/ A拍反向电流*/
	PH1=0;//PH1为0，A组线圈为反向电流
	T01=0;//以最大电流输出
	T11=0;
	PH2=1;//PH2为1，B线圈为正向电流
	T02=1;//关闭电流输出
	T12=1;
	Delay(2);
	
	/*A/B AB拍，A为反向电流，B为正向电流*/
	PH1=1;//PH1为1，A组线圈为正向电流
	T01=0;//以最大电流输出
	T11=0;
	PH2=1;//PH2为1，B线圈为正向电流
	T02=1;//关闭电流输出
	T12=1;
	Delay(2);
	
	/*B B为正向电流*/
	PH1=0;//PH1为0，A组线圈为反向电流
	T01=1;//关闭电流输出
	T11=1;
	PH2=1;//PH2为1，B线圈为正向电流
	T02=0;//
	T12=0;
	Delay(2);
	
	/*AB AB都为正向电流*/
	PH1=1;//PH1为1，A组线圈为正向电流
	T01=0;//以最大电流输出
	T11=0;
	PH2=1;//PH2为1，B线圈为正向电流
	T02=0;//以最大电流输出
	T12=0;
	Delay(2);
	
	/*A A为正向电流*/
	PH1=1;//PH1为1，A组线圈为正向电流
	T01=0;//以最大电流输出
	T11=0;
	PH2=1;//PH2为1，B线圈为正向电流
	T02=1;//关闭电流输出
	T12=1;
	Delay(2);
	
	/*AB/ A为正向电流,B为反向电流*/
	PH1=1;//PH1为1，A组线圈为正向电流
	T01=0;//以最大电流输出
	T11=0;
	PH2=0;//PH为0，B线圈为反向电流
	T02=0;//以最大电流输出
	T12=0;
	Delay(2);
	
	/*B/ B为反向电流*/
	PH1=1;//PH1为1，A组线圈为正向电流
	T01=1;//关闭电流输出
	T11=1;
	PH2=0;//PH2为0，B线圈为反向电流
	T02=0;//关闭电流输出
	T12=0;
	Delay(2);
	
	/*A/B/ AB都为反向电流*/
	PH1=0;//PH1为0，A组线圈为反向电流
	T01=0;//以最大电流输出
	T11=0;
	PH2=0;//PH2为0，B线圈为反向电流
	T02=0;//以最大电流输出
	T12=0;
	Delay(2);
	
}
void main()
{
	while(1)
	{
		Step();
	}
}